src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Покупатели</name>
      <description>Покупатели</description>
    </items>
    <items>
      <name>Поставщики</name>
      <description>Поставщики</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРожденияКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолКлиента</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИсточникИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ТипыКонтрагентов/ТипыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Контрагенты/ObjectModule.bsl
// Модуль объекта справочника "Контрагенты".
// Содержит бизнес-логику, выполняемую при записи элемента.

// Обработчик события "ПередЗаписью".
// Проверяет соответствие типа контрагента его родительской группе.
// Если контрагент помещается в предопределённую группу "Покупатели" или "Поставщики",
// то его тип должен совпадать с типом группы. В противном случае запись блокируется.
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
    
    // Получаем родительскую группу элемента.
    Родитель = ЭтотОбъект.Родитель;
    
    // Если родитель не задан (пустая ссылка), проверка не требуется.
    Если Родитель = Справочники.Контрагенты.ПустаяСсылка() Тогда
        Возврат;
    КонецЕсли;
    
    // Проверяем, является ли родитель одной из предопределённых групп.
    Если Родитель = Справочники.Контрагенты.Покупатели ИЛИ
        Родитель = Справочники.Контрагенты.Поставщики Тогда
        
        // Определяем допустимый тип контрагента для данной группы.
        ДопустимыйТип = Неопределено;
        Если Родитель = Справочники.Контрагенты.Покупатели Тогда
            ДопустимыйТип = Перечисления.ТипыКонтрагентов.Покупатель;
        Иначе
            ДопустимыйТип = Перечисления.ТипыКонтрагентов.Поставщик;
        КонецЕсли;
        
        // Сравниваем фактический тип контрагента с допустимым.
        Если ЭтотОбъект.ТипКонтрагента <> ДопустимыйТип Тогда
            Сообщить("Ошибка: в группе """ + Родитель.Наименование + 
                     """ можно создавать элементы только с типом """ + 
                     Строка(ДопустимыйТип) + """.");
            Отказ = Истина; // Блокируем запись.
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры
